{"inkVersion":18,"root":[["^In the center of this room is large stone sculpture: A huge kobold hand pointing at the floor. Its wrist reaches through a hole in the ceiling - too tight to let you see the forearm. The clawed thumb is tucked in and the extended first digit presses against the flagstones.","\n","^You check out the floor. It seems normal, you're not sure what the sculpture is saying.","\n",{"->":"options"},["done",{"#f":7,"#n":"g-0"}],null],"done",{"options":[["ev","str","^Inspect the sculpture.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Look for a mechanism.","/str",{"CNT?":".^.^.inspect"},{"VAR?":"coins"},0,">","&&","/ev",{"*":".^.c-1","flg":21},"ev","str","^Remove a gold coin from the stack. (1 effort)","/str",{"CNT?":".^.^.inspect"},{"VAR?":"effort"},0,">","&&",{"VAR?":"coins"},0,">","&&","/ev",{"*":".^.c-2","flg":5},"ev","str","^Exit. £E","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":[{"->":".^.^.^.inspect"},"\n",{"#f":7}],"c-1":["\n","ev",{"VAR?":"wisdom"},1,"+",{"temp=":"wisdom","re":true},"/ev","^You search high and low for buttons or levers. Nothing. All manner of prodding and massage reveal the hand and finger to be inscrutable. The walls and floor offer no secrets.","\n","^You take another look at the stack. On the edge of each coin is an inscription:","\n","^<i>Easily Impressed</i>","\n","^With a good strike of your spear you might be able to ruin the inscription. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["\n",{"->":"remove_coin"},{"#f":7}],"c-3":[{"->":"returning"},"\n",{"#f":7}]}],{"inspect":["^After making sure that no other challenges occupy the room, you take a closer look at what the stone hand is pointing at. Under the finger you can see a stack of coins.","\n","^You back up a bit and give the stack a poke with the butt of your spear. They won't move. They seem to be pressed tight against the floor.","\n","^You tap the sculpture. It doesn't move either. It must be very heavy.","\n",{"->":".^.^"},{"#f":3}],"#f":3}],"returning":["^You return to the room with the giant kobold hand pointing at the floor.","ev",{"VAR?":"coins"},0,">",{"CNT?":"options.inspect"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ The golden glint of its hostage gold remains under its finger.",{"->":".^.^.^.9"},null]}],"nop","\n",{"->":"options"},{"#f":3}],"remove_coin":["ev",{"VAR?":"effort"},1,"-",{"temp=":"effort","re":true},"/ev","ev",1,{"f()":"take"},"pop","/ev","\n",["ev","visit",2,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"nop",{"s0":["pop","^You hammer away at the stack with your spear but not a single piece of it moves. You even try lifting the sculpture but after pushing it from all sides you can't get it to move in the slightest.<br>Frustrated, you kick the stack. A single coin flies out from the pile, sliding across the the floor until it hits a wall. The finger closes the gap with a heavy clink. You kick it again but it yields no more. You fetch your prize whilst considering your next move.",{"->":".^.^.23"},null],"s1":["pop","^You try to wedge the blade of your spear's head between two of the coins in the stack. After half a minute of wiggling you've managed to get part of your spear in. You try to move your weapon but now it seems to be as stuck as the coins its sandwiched between. Several hard tugs free your spear and steal your balance. You fall over as a single coin flies out of the stack. You pick yourself up. Then you pick the coin up.",{"->":".^.^.23"},null],"s2":["pop","^You lie on your back next to the stack, positioning yourself under the closed fist of the stone hand. Putting your feet on the knuckles of it, you push with your legs whilst trying to pull the stack of coins away with your own hand. Every muscle you can conscript gives all it can. Suddenly you feel something shift, the coins move freely.<br>You swat the stack aside, sending its parts to three corners of the room. Then you roll away as the finger prods the floor with undeniable force. Finally you get up and collect your winnings.","ev",2,{"f()":"take"},"out","/ev",{"->":".^.^.23"},null],"#f":5}],"\n",{"->":"options"},{"#f":3}],"take":[{"temp=":"n"},"ev",{"VAR?":"coins"},{"VAR?":"n"},"-",{"temp=":"coins","re":true},"/ev","ev",{"VAR?":"gold"},{"VAR?":"n"},"+",{"temp=":"gold","re":true},"/ev",{"#f":3}],"global decl":["ev",5,{"VAR=":"effort"},0,{"VAR=":"gold"},0,{"VAR=":"wisdom"},5,{"VAR=":"coins"},"/ev","end",null],"#f":3}],"listDefs":{}}