{"inkVersion":18,"root":[["^Stepping into this room you blink a few times, unsure of what you're seeing. Unlike the rest of the dungeon the walls, floor, and ceiling are covered in a colourful fresco. The painting depicts kobolds doing all manner of tasks, but averting their gaze from above. ",{"->":"options"},"\n",["done",{"#f":7,"#n":"g-0"}],null],"done",{"options":[["ev","str","^Look at the ceiling.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Stare at the ceiling.","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":21},"ev","str","^Chisel out the dragon's eyes with your spear.","/str",{"CNT?":".^.c-1"},"/ev",{"*":".^.c-2","flg":21},"ev","str","^Look at the painted kobolds.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Exit. £E","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n","^You look up and instinctively shield yourself from the sight of it. A detailed rendering of a terrifying dragon. It must be Felkar, the ancient drake that used to rule over the kobold tribes before their emancipation.","\n","^Images of the old master are rare. Reminders of his tyranny are considered a bad omen. ","<>","\n",["ev",{"VAR?":"luck"},0,">","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"luck"},1,"-",{"temp=":"luck","re":true},"/ev","^You feel somewhat cursed for having gazed upon it.","\n",{"->":".^.^.^.7"},null]}],"nop","\n",{"->":".^.^.^"},{"#f":7}],"c-1":["\n","ev",{"VAR?":"gold"},1,"+",{"temp=":"gold","re":true},"/ev","ev",{"VAR?":"luck"},1,"+",{"temp=":"luck","re":true},"/ev","ev",1,"/ev",{"temp=":"brave","re":true},"^Steeling yourself, you take a longer look at the ceiling. It reminds you that a kobold named Gosek defeated this dragon and banished it from the mountain. A kobold like none other, but still a lesson that such potential exists in your kind.","\n","^You notice the dragon's eyes are shining yellow. Perhaps a coin is under there. ",{"->":".^.^.^"},"\n",{"#f":7}],"c-2":["\n","ev",1,"/ev",{"temp=":"vandal","re":true},"^You chisle away at the dragon's face with your spear and underneath the plaster you find a gold coin. A shame that you had to ruin such a nice painting to get your payment.","\n",{"->":".^.^.^"},{"#f":7}],"c-3":["\n","ev",{"VAR?":"wisdom"},1,"+",{"temp=":"wisdom","re":true},"/ev","^You look at the painted kobolds. Many toil carving through rock and building mazes around their master's lair. The level of detail is such that you can make out individual tribes: Atii kobolds constructing traps and mechanisms, Hachar kobolds pointing and directing, Katar kobolds farming fungus and wheeling supplies. Rarely you can see the outline of a Jeai kobold, their camouflage only betrayed by their golden eyes.","\n","^You search the walls and floor but find no Kyeh kobolds. As if your tribe were written out of history.","\n",{"->":".^.^.^"},{"#f":7}],"c-4":[{"->":"returning"},"\n",{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"returning":["^You return to the painted room. ","<>","\n",["ev",{"VAR?":"vandal"},"/ev",{"->":".^.b","c":true},{"b":["\n","^The artwork is still impressive despite your vandalism.","\n",{"->":".^.^.^.6"},null]}],["ev",{"VAR?":"brave"},"/ev",{"->":".^.b","c":true},{"b":["\n","^The dragon's eyes shine golden as you make your way through.","\n",{"->":".^.^.^.6"},null]}],[{"->":".^.b"},{"b":["\n","^You are careful to not look up.","\n",{"->":".^.^.^.6"},null]}],"nop","\n",{"->":"options"},{"#f":3}],"global decl":["ev",1,{"VAR=":"gold"},0,{"VAR=":"wisdom"},1,{"VAR=":"luck"},0,{"VAR=":"brave"},0,{"VAR=":"vandal"},"/ev","end",null],"#f":3}],"listDefs":{}}