{"inkVersion":18,"root":[["^You walk into a room where the walls are lined with bookshelves. A closer look reveals that most of the books in this library are fake. Planks of wood, carved and painted. Only 3 of them are real.","\n","^There is also a large chair here. You give it a few pokes to see if it's part of a trap but it looks like it's just a big chair.","\n",{"->":"options"},["done",{"#f":7,"#n":"g-0"}],null],"done",{"options":[["ev","str","^Read a book.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Sit in the chair.","/str",{"VAR?":"effort"},{"VAR?":"effortMax"},"<","/ev",{"*":".^.c-1","flg":21},"ev","str","^Exit. £E","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":[{"->":".^.^.^.choose_book"},"\n",{"#f":7}],"c-1":["\n","ev",{"VAR?":"effort"},1,"+",{"temp=":"effort","re":true},"/ev","^You take a moment to rest and sit in the big chair. It creaks suspiciously as you sit down but you eventually let it take all your weight and even lean back.","\n","^It seems quieter in here than in the rest of the dungeon, quite a pleasant reading room despite what it's connected to. When you finally get up again you feel more relaxed.","\n",{"->":".^.^.^"},{"#f":7}],"c-2":[{"->":"returning"},"\n",{"#f":7}]}],{"choose_book":[["^You decide to read a book, but which one?","\n","ev","str","^Get Rich Quick by Bokcha Atii.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Triggering Traps by Gek the Terrible.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^The Kobold Emancipation by Hneet Emjinti.","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",{"CNT?":"rich"},0,"==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"rich"},{"->":".^.^.^.8"},null]}],[{"->":".^.b"},{"b":[{"->":"rich_read"},{"->":".^.^.^.8"},null]}],"nop","\n",{"#f":7}],"c-1":[{"->":"trigger"},"\n",{"#f":7}],"c-2":[{"->":"history"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"rich":["ev",{"VAR?":"gold"},3,"+",{"temp=":"gold","re":true},"/ev","^You take Get Rich Quick by Bokcha Atii down from its shelf. Its weight feels strangely uneven and the pages seem stuck togeher. You open the cover to find that a hole has been cut through all the pages, turning the book into a container. It holds 3 gold coins.","\n","^You heed the advice of the book's title and take the gold before putting the book back on the shelf.","\n",{"->":"options"},{"#f":3}],"rich_read":["^You take Get Rich Quick by Bokcha Atii down from its shelf. You flip open the cover to see if more gold coins have managed to find their way into its compartment but it only holds the disappointment of nothing.","\n",{"->":"options"},{"#f":3}],"trigger":[["^You take Triggering Traps by Gek the Terrible down from its shelf and the book leaps out of your hands. It opens to reveal rows of sharp teeth and a throat that is deep enough to be impossible. You swiftly bat the monstrous book aside and point your spear at it.","\n","^On the floor the book slowly opens its mouth, betting its bite against your spear.","\n","ev","str","^Attack Triggering Traps by Gek the Terrible. (0-3 effort)","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Escape. £E","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"attack"},"\n",{"#f":7}],"c-1":[{"->":"returning"},"\n",{"#f":7}]}],{"#f":3}],"attack":["ev",0,3,{"f()":"luckHit"},"/ev",{"temp=":"cost"},["ev",{"VAR?":"cost"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","^You slide your spear under the open cover of the book and flip the beast over. It teeth scrape against floor and you see its spine flex. You strike the book with your spear, the tome lets out an unholy wail and brown smoke leaks out of the wound you've created. You pull the spear free and the book crumbles into ash.","\n",{"->":"attack.9"},null]}],["ev",{"VAR?":"effort"},0,"<=","/ev",{"->":".^.b","c":true},{"b":["\n","^You try to stab it in the roof of its mouth but your lunge sends you stumbling forwards. The book-mouth opens impossibly wide and you fall inside. As you slide into the fleshy tunnel you strike your spear into its tongue, aiming to climb out. You coil up to leap out of the teeth rimmed opening before you.","\n","^The teeth snap shut. It is dark and moist. Suddenly you are crushed from all sides. The book is returning to its normal size. You don't survive.","\n","end",{"->":"attack.9"},null]}],[{"->":".^.b"},{"b":["\n","^You feint a strike to get the book to snap itself closed but it leaps off of the floor towards you. A panicked twirl of your spear knocks it aside and it flies unnaturally around the room, flapping its cover and pages in a mockery of bird flight. It swoops down to attack and you dive to the floor. It makes ","ev",{"VAR?":"cost"},2,"*","out","/ev","^ more passes like this, with you diving out of the way before you manage to knock it out of the air and deal a killing blow. The book wails and crumbles into ash.","\n",{"->":"attack.9"},null]}],"nop","\n","^You survey the room, making sure that this was the only lesson the book had to teach. Satisfied the area is clear you feel you learned it well: The creator of this place has a terrible sense of humour.","\n",{"->":"options"},{"#f":3}],"returning":["^You return to the fake library room. ","<>","\n",["ev",{"CNT?":"attack"},"/ev",{"->":".^.b","c":true},{"b":["\n","^The pile of ash on the floor, the two real books, and the large chair remain unchanged.","\n",{"->":".^.^.^.6"},null]}],["ev",{"CNT?":"trigger"},"/ev",{"->":".^.b","c":true},{"b":["\n","^The monstrous tome of Triggering Traps by Gek the Terrible waits on the floor. It grins at your arrival.","\n",{"->":".^.^.^.traps"},{"->":".^.^.^.6"},null]}],[{"->":".^.b"},{"b":["\n","^The three real books and the large chair are just where you left them.","\n",{"->":".^.^.^.6"},null]}],"nop","\n",{"->":"options"},{"traps":[["ev","str","^Attack the book. (0-3 effort)","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Run past the book. (0-1 effort)","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Return the way you came. £R","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":[{"->":"attack"},"\n",{"#f":7}],"c-1":["\n","ev",0,3,{"f()":"luckHit"},"/ev",{"temp=":"cost"},["ev",{"VAR?":"cost"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","^You raise your spear to attack the book, it hisses in reply. Then you run away. You hear the disgrunted flapping of its cover against the floor as it rethinks its tactics, but you've already fled the room.","\n",{"->":".^.^.^.10"},null]}],["ev",{"VAR?":"effort"},0,"<=","/ev",{"->":".^.b","c":true},{"b":["\n","^You dash to your left and shortly hear a the flapping of a book cover from behind. You turn around to jab at the creature but there's nothing there. Turning full circle you still see no sign of the book. Then you hear a single flap from directly above you. The book hangs motionless above you, open. A gob of spit drops from its mouth and hits you in the eye. You blink out of reflex and suddenly feel rush of air at your face. Two wet walls of flesh slap either side of your head and sharp spiny blades slice through your neck. The last thing you hear could only be the sound of your lifeless body hitting the floor.","\n","end",{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["\n","^You dash to your ",["ev","visit",2,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^right",{"->":".^.^.17"},null],"s1":["pop","^left",{"->":".^.^.17"},null],"#f":5}],"^ but the book manages to leap from the floor and bite on to your spear. You're forced to shake it off, stunning it against the shelves of fake books before you can flee.","\n",{"->":".^.^.^.10"},null]}],"nop","\n",["ev","str","^Exit. £E","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"returning"},"\n",{"#f":7}]}],{"#f":7}],"c-2":[{"->":".^.^.^.^"},"\n",{"#f":7}]}],{"#f":3}],"#f":3}],"death":["done",{"#f":3}],"history":["^You take The Kobold Emancipation by Hneet Emjinti down from its shelf",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop",{"->":".^.^.17"},null],"s1":["pop","^ again",{"->":".^.^.17"},null],"#f":5}],"^. ",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^It is a rather large book, too big to read in one sitting. You open it to a random page and read a passage.",{"->":".^.^.17"},null],"s1":["pop",{"->":".^.^.17"},null],"#f":5}],"\n",{"->":".^.passage"},{"passage":[[["ev",{"CNT?":"finish_book"},"!","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"wisdom"},1,"+",{"temp=":"wisdom","re":true},"/ev",{"->":".^.^.^.1"},null]}],"nop","\n","^<i>",["ev","visit",4,"%","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"nop",{"s0":["pop","^The Hachar tribe originally began as the religious order serving the ancient dragon Felkar. Clerics were deemed fit for service when they had spoken to the master and survived. Only a few passed the test resulting in relaxed rules to allow others to serve the order under the real clerics. The extra staff allowed the Hachar to maintain control of the population so well that the tribe's identity shifted towards secretarial work. The dissolution of the priests into the administrative staff we have today accelerated during the Emancipation. The heads of the religious order were rounded up and exiled, leaving many Hachar who were simply good at organising things. In the chaos after Felkar's fall this was a skill in high demand. After a fashion the Hachar have retained the same control over kobold society that they had before. Answering to a higher power and telling other tribes how many kobolds must be sacrificed to a cause.",{"->":".^.^.29"},null],"s1":["pop","^No written or spoken history predates the rule of Felkar the Unbearable. It is impossible to tell how long the ancient dragon spent shaping kobolds to its purpose. Or how old Felkar was before kobolds came into its care. The Great Cavern beneath the Greater Mountain in which the dragon used to reside was stripped clean of wealth and soon demolished to clean away every trace of the old master. Much of this is caused by the legend of Felkar's gaze - to be looked upon by the dragon was a death sentence. Thus many tapestries, paintings, and drawings were destroyed out of superstition. Kobolds even consider it an obscene gesture to pinch thumb and middle fingers together and raise the first and last fingers to make a horned dragon. And so they perform it as often as possible at sources of frustration.",{"->":".^.^.29"},null],"s2":["pop","^The tribe of Gosek the Brave remains unknown. Some sources suggest the individual was a mongrel, combining the talents of several tribes. No doubt to claim ownership of the legend. Others say Gosek was a part of a secret breeding program to produce a new tribe. The banishment spell that Gosek cast is still being researched today though the expertise and technology involved are beyond kobold reckoning. Eye witness accounts report the hero performed a form of multiplication upon themself to appear in many places at once - allowing Gosek to cast a truly powerful spell via a network of synchronised proxies. A feat further applified through an array of structures Gosek had created whilst serving Felkar as chief dungeon designer. Others say that Gosek marshalled a great many kobolds with fragments of the spell, orchestrating so many as to shame the Hachar. None will entertain that Gosek never existed, too many eyewitnesses insist they saw Gosek or knew someone that saw Gosek. All with a different tale to tell.",{"->":".^.^.29"},null],"s3":["pop",{"->t->":"finish_book"},{"->":".^.^.29"},null],"#f":5}],"^</i>","\n","ev","str","^Return the book to the shelf.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Read another passage.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You return the book to its shelf.","\n",{"->":"options"},{"#f":7}],"c-1":["\n","^You read another passage:","\n",{"->":".^.^.^"},{"#f":7}]}],{"#f":3}],"#f":3}],"finish_book":[["^The Kyeh tribe are closer to beasts than kobolds of nobler stock. Reserved for tasks no well bred kobold should be doing, lest we lose more precious minds to folly. Few survived Felkar's demise. Fit for no other task, many were put to work clearing away rubble and inspecting the mountain for habitable caves. Some tribes have managed to evolve beyond the designs of their former master, sadly the Kyeh show no sign of doing so.</i>","\n","^It says nothing more about your tribe and what remains of the book is illustrations of the ancient kobold texts and the data extracted from them.","\n","ev","str","^Return the book to the shelf.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^You return the book to its shelf.","\n",{"->":"options"},{"#f":7}]}],{"#f":3}],"luckHit":[{"temp=":"max"},{"temp=":"min"},"ev",{"VAR?":"min"},{"VAR?":"max"},"rnd","/ev",{"temp=":"c"},["ev",{"VAR?":"luck"},0,">",{"VAR?":"c"},0,">","&&","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"luck"},1,"-",{"temp=":"luck","re":true},"/ev","ev",0,"/ev",{"temp=":"c","re":true},{"->":".^.^.^.9"},null]}],"nop","\n","ev",{"VAR?":"effort"},{"VAR?":"c"},"-",{"temp=":"effort","re":true},"/ev","ev",{"VAR?":"c"},"/ev","~ret",{"#f":3}],"global decl":["ev",20,{"VAR=":"effort"},0,{"VAR=":"luck"},1,{"VAR=":"gold"},3,{"VAR=":"effortMax"},0,{"VAR=":"wisdom"},"/ev","end",null],"#f":3}],"listDefs":{}}