{"inkVersion":18,"root":[[{"#":"m_fade_1"},{"->":"loop"},["done",{"#f":7,"#n":"g-0"}],null],"done",{"loop":[["^Welcome kobold dungeon tester.","\n","^This is a multiple choice adventure game. You play the whole adventure only by choosing the options below the text. If an item is in your inventory and can be used you will be given an option to use it.","\n","ev","str","^Okay.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":7}],"g-0":["^Dungeons are deadly. There are four numbers to describe your toil and progress. Two to make you worry, and two to mark your achievements.","\n","^<sprite name=effort> <b>effort:</b> Some options will cost <b>effort</b>. If you run out of <b>effort</b>, the adventure is over. You start with <b>","ev",{"VAR?":"effortMax"},"out","/ev","^ effort</b>.","\n","^<sprite name=luck> <b>luck:</b> The game will spend your <b>luck</b> to protect you from danger. You start with <b>","ev",{"VAR?":"luck"},"out","/ev","^ luck</b>.","\n","^<sprite name=wisdom> <b>wisdom:</b> All is not what it appears. Within some choices you will gain <b>wisdom</b>. Your maximum <b>effort</b> increases by one for every <b>","ev",{"VAR?":"wisToEffort"},"out","/ev","^ wisdom</b> you collect. You start with <b>0 wisdom</b>.","\n","^<sprite name=gold> <b>gold:</b> The dungeon contains <b>gold</b>. The best dungeon testers escape with lots of it. You start with <b>0 gold</b>.","\n","ev","str","^Start the adventure.","/str","/ev",{"*":".^.c-1","flg":4},{"c-1":["\n",{"->":"loop.0.g-1"},{"#f":7}],"#f":7}],"g-1":["^The kobolds of your mountain look like humanoid dragons, though three feet tall and without the wings. The many clans are each specialised for a certain task. The Jeai guard the tunnels, the Hachar administer, the Atii make wonders.","\n","^You are a kobold of the Kyeh tribe, raised to be sent into the most dangerous of spaces. The logic being that if you don't come back, it's too dangerous.","\n","^You stand at the entrance of a dungeon. A selection of rooms designed by Gek the Terrible, creator of many traps that protect the mountain. Only the ones that maim and kill you will go on to defend the tribes. Escape alive and you will be allowed to keep the gold you find as payment.","\n","^Future victims are expected to be armed, so you have been given a spear to add realism to your death.","\n","ev","str","^Enter. £D","/str","/ev",{"*":".^.c-2","flg":4},{"c-2":[{"->":"loop"},"\n",{"#f":7}],"#f":7}]}],{"#f":3}],"global decl":["ev",3,{"VAR=":"effortMax"},8,{"VAR=":"wisToEffort"},0,{"VAR=":"luck"},"/ev","end",null],"#f":3}],"listDefs":{}}